

autitoriy = {
    "13": "Кресак Юрій Юрійович - Історія та основи правознавства",
    "18": "Загоруйко Віктор Леонтійович - Бізнес планування та інновації",
    "14": "Вісина Тетяна Миколаївна - Менеджмент",
    "15": "Давидюк Оксана Степанівна - Підприємництво",
    "17": "Цвіль Оксана Вікторівна, Діжак Ольга Іванівна - Методична служба",
    "23": "Буснюк Світлана Володимирівна - Заступник директора з навчальної роботи",
    "22": "Шавиріна Євгенія Іванівна - Головний бухгалтер",
    "21": "Цвіль Оксана Вікторівна - Конференційна зала",
    "32": "Соколюк Наталія Петрівна - Інформаційні системи та технології",
    "27": "Великий Олександр Анатолійович - Stem-технології",
    "28": "Кшановський Роман Олександрович, Данилюк Ірина Вікторівна - Завідувач відділень",
}
