# Перший словник
my_dict = {
    "імʼя": "Богдан",
    "скільки років": 16,
    "Деталі": {
        "ріст": 185,
        "вага": 70,
        "хоббі": "Баскетбол",
        "звідки родом": "Луцьк"
    },
    "активний": True
}

# Словник з типами даних
types_dict = {
    "імʼя": type(my_dict["імʼя"]).__name__,
    "скільки років": type(my_dict["скільки років"]).__name__,
    "Деталі": {
        "ріст": type(my_dict["Деталі"]["ріст"]).__name__,
        "вага": type(my_dict["Деталі"]["вага"]).__name__,
        "хоббі": type(my_dict["Деталі"]["хоббі"]).__name__,
        "звідки родом": type(my_dict["Деталі"]["звідки родом"]).__name__,
    },
    "активний": type(my_dict["активний"]).__name__
}

print("Перший словник:")
print(my_dict)
print("\nСловник з типами даних:")
print(types_dict)
